from decimal import Decimal
from fractions import Fraction
from typing import TypeVar


# Комплексные числа не используем - для них не имеет смысла сравнение на больше-меньше.
NumericType = TypeVar('NumericType', int, float, Decimal, Fraction)


def max(x: NumericType, y: NumericType) -> NumericType:
    """
    Поиск максимума из двух чисел.
    Не используем встроенную функцию - ищем максимум самостоятельно.
    Докажем корректность данной функции.
    {P: m и n являются вещественными числами И x = m И y = n} max(x, y) {Q: res = максимальное из m и n}
    Для условного оператора нужно доказать обе ветви.
    Первая ветвь:
    {P: m и n являются вещественными числами И x = m И y = n И x > y} 
    res = x, соответственно res = m, что является максимальным из m и n при m > n.
    Вторая ветвь:
    {P: m и n являются вещественными числами И x = m И y = n И x <= y} 
    res = y, соответственно res = n, что является максимальным из m и n при m <= n.
    Итого доказали, что постусловие будет истинным после выполнения {Q: res = максимальное из m и n}.
    """
    if x > y:
        return x
    return y


def abs(x: NumericType) -> NumericType:
    """
    Поиск модуля числа.
    Не используем встроенную функцию - ищем модуль самостоятельно.
    Докажем корректность данной функции.
    {P: m является вещественными числами И x = m} abs(x) {Q: res = |m|}
    Для условного оператора нужно доказать обе ветви.
    Первая ветвь:
    {P: m является вещественными числами И x = m И x < 0}
    res = -x
    Модуль отрицательного числа противоположен по знаку числу, данная ветвь корректна.
    Вторая ветвь:
    {P: m является вещественными числами И x = m И x >= 0}
    res = x
    Модуль положительного числа или нуля равен самому числу, данная ветвь корректна.
    Итого доказали, что постусловие {Q: res = |m|} будет истинным после выполнения.
    """
    if x < 0:
        return -x
    return x


def maxabs(x: NumericType, y: NumericType) -> NumericType:
    """
    Поиск максимума из модулей двух чисел.
    Докажем корректность данной функции.
    {P: m и n являются вещественными числами} maxabs(m, n) {Q: res = max(|m|, |n|)}.
    1. Корректности вызываемых функций max() и abs() уже доказаны ранее:
    {P: m и n являются вещественными числами И x = m И y = n} max(x, y) {Q: res = максимальное из m и n}.
    {P: m является вещественными числами И x = m} abs(x) {Q: res = |m|}.
    2. abs_x = abs(x)
    Уже доказано, что {P: m является вещественными числами И x = m} abs(x) {Q: res = |m|}.
    Подставляем x и получаем, что abs_x = |x|.
    3. abs_y = abs(y)
    Аналогично п.2 получаем, что abs_y = |y|.
    4. result = max(abs_x, abs_y)
    Уже доказано, что 
    {P: m и n являются вещественными числами И x = m И y = n} 
    max(x, y) 
    {Q: res = максимальное из m и n}.
    Подставляем abs_x и abs_y и получаем, что res =  = максимальное из abs_x и abs_y.
    Итого доказали, что постусловие {Q: res = max(|m|, |n|)} будет истинным после выполнения.
    """
    abs_x = abs(x)
    abs_y = abs(y)
    result = max(abs_x, abs_y)
    return result


def main():
    print(maxabs(5, 2))                             # Выведет 5 - это int(5)
    print(maxabs(-5.5, 1.0))                        # Выведет 5.5 - это float(5.5)
    print(maxabs(Decimal('-5.7'), Decimal('3.4')))  # Выведет 5.7 - это Decimal(5.7)
    print(maxabs(Decimal('0'), Decimal('-3.4')))    # Выведет 3.4 - это Decimal(3.4)
    print(maxabs(Fraction(5,6), Fraction(1,2)))     # Выведет 5/6 - это Fraction(5, 6)


if __name__ == "__main__":
    main()
